Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །ཀྱེ་རྒྱལ་བའི་སྲས་འཇིག་རྟེན་གྱི་ཁམས་འདིར་བདག་ཅག་ཇི་ལྟར་ཕྱིན་པ་དེ་བཞིན་དུ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་རེ་རེའི་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་གནས་ཀྱི་ལྷའི་རྒྱལ་པོ་དབང་བསྒྱུར་གྱི་གཞལ་མེད་ཁང་ནོར་བུ་རིན་པོ་ཆེའི་སྙིང་པོར་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་ཁྲག་ཁྲིག་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཕྱིན་པར་གྱུར་ཏོ།
en: “O jinaputras! In the same way that we have arrived in this world, at the central platform of precious jewels in the deva king Vaśavartin’s palace in the Para­nirmita­vaśa­vartin paradise of this four-continent world, in that way bodhisattvas to the number of atoms in a hundred million buddha realms have arrived at every central platform of precious jewels in the deva king Vaśavartin’s palace in the Para­nirmita­vaśa­vartin paradise in each four-continent world in the ten directions.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས། ཕྱོགས་བཅུར་བལྟས་ཏེ་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ལ་བལྟས་ནས། ཆོས་ཀྱི་དབྱིངས་ལ་རྣམ་པར་བལྟ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་སེམས་བསྐྱེད་པ་ཡང་དག་པར་བརྗོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡུལ་ཡང་དག་པར་བསྟན་པ་དང་། སྤྱོད་པའི་སྟོབས་ཡོངས་སུ་སྦྱངས་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཡང་དག་པར་བསྒྲུབ་པ་བརྗོད་པ་དང་། འཇིག་རྟེན་གྱི་དྲི་མ་སེལ་བ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཉེ་བར་བསྒྲུབ་པ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་ཡེ་ཤེས་ཀྱི་རྒྱན་ཡོངས་སུ་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་རབ་ཏུ་བརྗོད་པ་བྱེད་ཅིང་སའི་དོན་འདི་ཡང་བརྟག་པར་བྱ་བ་དང་། བསྟན་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་མཐུས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Then the bodhisattva Vajra­garbha looked into the ten directions, saw the complete assemblies, saw the realm of phenomena, and describing the development of the aspiration to omniscience, teaching the range of activity of the bodhisattva, making pure the power of conduct, discoursing upon all forms of knowledge, removing worldly stains, summarizing omniscient wisdom, teaching the crown ornament of inconceivable knowledge, making evident the qualities of all bodhisattvas, and thus teaching the meaning of the bhūmis through the power of the buddhas, he recited these verses at that time: “Listen to the special excellent conduct of the bodhisattvas

source: །ཞི་དང་དུལ་དགའ་ཞི་ཞིང་དུལ་བའི་ཡིད་ལྡན་ལ།
en: Who are devoted to tranquility and restraint, have pacified, tamed minds,

source: །ནམ་མཁའི་དབྱིངས་འདྲ་བར་སྣང་མཁའ་དང་མཚུངས་འདྲ་ཞིང་།
en: Are like the expanse of the sky, are the same as space,

source: །ཐ་བའི་དྲི་མ་རྣམ་སྦྱངས་ལམ་རྣམས་ཤེས་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཁྱད་པར་རབ་ལ་ཉོན།
en: Have removed the last stain, and remain in the wisdom of the path.

source: །བསྐལ་པ་བྱེ་བར་དགེ་བ་བརྒྱ་སྟོང་རབ་བསགས་ཤིང་།
en: “They have accumulated hundreds of thousands of good actions for millions of eons,

source: །སངས་རྒྱས་བརྒྱ་སྟོང་དྲང་སྲོང་ཆེན་པོ་མཆོད་བྱས་ཏེ།
en: They have made offerings to hundreds of thousands of buddhas, great sages,

source: །དབང་བསྒྱུར་རྣམས་དང་རང་རྒྱལ་མཐའ་ཡས་མཆོད་བྱས་ནས།
en: They have made endless offerings to self-controlled pratyekabuddhas,

source: །འགྲོ་བ་ཀུན་ལ་ཕན་ཕྱིར་བྱང་ཆུབ་སེམས་སྐྱེའོ།
en: And in order to benefit beings, they develop bodhicitta.

source: །བརྟུལ་ཞུགས་དཀའ་ཐུབ་དཀའ་སྤྱད་དུལ་བཟོད་ལྡན་གྱུར་ལ།
en: “Those who have special discipline, undergo austerities, have perfect patience,

source: །ཁྲེལ་ཡོད་དཔལ་གྱིས་སྤྱོད་ལྡན་ཡེ་ཤེས་དགེ་འཕགས་ཤིང་།
en: Have conduct based on a sense of shame, have attained merit and wisdom,

source: །བློ་གྲོས་རིག་ཡངས་སངས་རྒྱས་ཡེ་ཤེས་སེམས་ལྡན་གྱི།
en: Have understanding that is vast, and aspire to the wisdom of buddhahood

source: །བྱང་ཆུབ་སེམས་རབ་རྒྱལ་བའི་སྟོབས་དང་མཉམ་འདྲ་སྐྱེ།
en: Develop a bodhicitta that is the same as and equal to the ten strengths of the jinas.

source: །དུས་གསུམ་རྒྱལ་བ་ཇི་སྙེད་མཆོད་རབ་མཆོད་པའི་ཕྱིར།
en: “In order to make offerings to all the jinas in the three times,

source: །ནམ་མཁའི་དབྱིངས་ཚད་ཞིང་རྣམས་ཐམས་ཅད་ཡོངས་སུ་སྦྱོང་།
en: Purify all realms throughout the extent of space.

source: །ཆོས་རྣམས་ཐམས་ཅད་ཇི་སྙེད་དེ་དག་མཉམ་རྟོགས་པས།
en: By comprehending the sameness of all phenomena,

source: །འགྲོ་བ་དགྲོལ་བའི་དོན་དུ་བྱང་ཆུབ་སེམས་སྐྱེའོ།
en: Bodhicitta is developed for the sake of the liberation of beings.

source: །གཞལ་ཡས་སེམས་སྐྱེས་ས་མཆོག་རབ་ཏུ་ཐོབ་གྱུར་ནས།
en: “Having attained the perfect bhūmi of developing immeasurable motivation,

source: །སྡིག་པ་ཐམས་ཅད་བསལ་ཕྱིར་རྡུལ་མེད་རབ་ཏུ་དགའ།
en: They rejoice in stainlessness in order to eliminate all bad actions.

source: །སྨོན་ལམ་སྟོབས་དཔྱད་དཀར་ཆོས་ཡང་དག་བསྩགས་བྱས་ནས།
en: They employ the power of prayer and accumulate good qualities.

source: །སྙིང་རྗེ་བརྩེ་ལྡན་ས་ཡི་གོང་མ་ཡོངས་སུ་གནོན།
en: They have love and compassion and ascend to the next bhūmi.

source: །འགྲོ་ཕྱིར་བྱམས་སེམས་ཚུལ་ཁྲིམས་ཐོས་དང་ཡོན་ཏན་ལྡན།
en: “They have love for beings, correct conduct, learning, and qualities,

source: །དྲི་མེད་དྲི་བྲལ་རང་བཞིན་ཡང་དག་བསམ་པ་ཡིས།
en: And with a genuine motivation that is stainless and pure

source: །འཇིག་རྟེན་ཐམས་ཅད་མེ་གསུམ་འབར་བར་མཐོང་གྱུར་ནས།
en: They see all worlds burning with the three fires,

source: །གསུམ་པ་རྣམ་ཡངས་བློ་ཡིས་འགྲོ་བའི་དོན་དུ་གནོན།
en: And with vast understanding they ascend to the third bhūmi for the sake of beings.

source: །སྡུག་བསྔལ་མི་རྟག་ནད་པ་ཟུག་རྔུས་མི་བདེ་བའི།
en: “They aspire to the excellence of the jinas on seeing the defects of composite phenomena:

source: །ཁམས་གསུམ་རྟག་ཏུ་སྡུག་བསྔལ་བརྒྱ་ཡི་མེ་འབར་བས། །འདུས་བྱས་ཉེས་མཐོང་རྒྱལ་བའི་ལེགས་པ་མངོན་མོས་ཤིང་།
en: That the three realms are continually burning with hundreds of sufferings And that there is suffering, impermanence, illness, pain, and unhappiness,

source: །ཡེ་ཤེས་འོད་འཕྲོ་ཡངས་ལྡན་འོད་འཕྲོ་ཡོད་པ་གནོན།
en: And so they ascend to Shining, which has the vast shining light of wisdom.

source: །དྲན་དང་བློ་ལྡན་ལམ་གྱི་ཡེ་ཤེས་ཐོབ་གྱུར་ཅིང་།
en: “With mindfulness and intelligence they attain the wisdom of the path,

source: །ས་མཆོག་དེ་ལ་སངས་རྒྱས་བརྒྱ་སྟོང་བསྙེན་བཀུར་ནས།
en: And on that perfect bhūmi they serve a hundred thousand buddhas,

source: །མི་ཡི་གཙོ་བོའི་ཡོན་ཏན་རྟག་ཏུ་དྲན་བྱེད་ཅིང་།
en: Always mindful of the qualities of those who are supreme among humans,

source: །འགྲོ་བ་ཀུན་གྱིས་ཐུབ་དཀའ་རྒྱལ་བར་དཀའ་བ་གནོན།
en: And they ascend to Difficult to Conquer, which is difficult for all beings to accomplish.

source: །ཡེ་ཤེས་བློ་གྲོས་ཐབས་དང་ཤེས་རབ་བློ་དཔྱོད་པས།
en: “They have realization, knowledge, method, wisdom, and analysis,

source: །འགྲོ་དོན་མཐའ་ཡས་སྣ་ཚོགས་བྱ་བ་བསྟེན་བྱས་ཤིང་།
en: So that they demonstrate various kinds of activities that bring infinite benefit to beings.

source: །སྟོབས་བཅུ་མཆོད་པ་སེམས་ཅན་དོན་རྣམས་བསྒྲུབས་བྱས་ཏེ།
en: They offer to those with the ten strengths and accomplish the benefit of beings.

source: །མི་སྐྱེ་མངོན་སུམ་མཐའ་ཡས་ས་དྲུག་ཡོངས་སུ་གནོན།
en: They ascend to the sixth bhūmi—infinite manifested birthlessness.

source: །འཇིག་རྟེན་ཀུན་ཏུ་འགྲོ་བས་ཤེས་དཀའ་སྤྱོད་བྱེད་ཅིང་།
en: “They go to all worlds and accomplish conduct that is difficult to comprehend.

source: །བདག་བྲལ་བྱེད་མེད་ཡོད་དང་མེད་པ་རྣམ་བསྩལ་བའི།
en: Without self, without action, free of existence and nonexistence,

source: །རང་བཞིན་སྟོང་ཆོས་ཡན་ལག་བཅུ་གཉིས་རབ་འབྱུང་ཞེས།
en: The twelve aspects of the nature of emptiness arise,

source: །ཕྲ་ཞིང་རྣོ་བའི་སེམས་ལྡན་བདུན་པ་ཡོངས་སུ་གནོན།
en: And with subtle and sharp minds they ascend to the seventh.

source: །ཐབས་དང་ཤེས་རབ་སེམས་ཡངས་རབ་ཏུ་ཐོབ་གྱུར་ཅིང་།
en: “They attain the vast mind of method and wisdom,

source: །རིང་དུ་སོང་བ་གདུལ་དཀའ་རིང་དུ་སོང་བ་གནོན།
en: And they ascend to Gone Far, which is gone far upon that which is difficult to tame.

source: །རང་བཞིན་དུལ་ཞིང་ཞི་ཕྱིར་དུ་མའི་སེམས་སྤངས་ཏེ།
en: They have a nature that is peaceful and restrained, eliminating a mind of multiplicity,

source: །དེ་ནས་ནམ་མཁའ་འདྲ་བའི་མི་གཡོ་ཡོངས་སུ་གནོན།
en: And they ascend to Unwavering, which is like space.

source: །དེ་ལ་མཁས་པའི་ཡེ་ཤེས་ལས་རྣམས་སྣ་ཚོགས་ཕྱིར།
en: “They have the wisdom in being skilled in that, and for the sake of various activities

source: །ཞི་བ་དེ་ལས་བསླང་ཞིང་མི་ཡི་མཆོག་ཏུ་བསྣམས།
en: They arise from the state of peace and are supreme among humans.

source: །དབང་བཅུ་ལྡན་ཞིང་འཇིག་རྟེན་ཡང་དག་ཉིད་དཔྱད་པའི།
en: They have the ten strengths and examine the world perfectly,

source: །རང་བཞིན་ཆེན་པོ་འགྲོ་ཕྱིར་ལེགས་པའི་བློ་གྲོས་གནོན།
en: And in order to go to the great nature, they ascend to Perfect Understanding.

source: །འདི་ལ་ཤིན་ཏུ་ཕྲ་བར་འཇིག་རྟེན་ཀུན་དཔྱད་ཅིང་།
en: “In this they analyze the worlds with extremely subtlety;

source: །སེམས་ཅན་ཐིབས་པོའི་སྤྱོད་ལྡན་ཉོན་མོངས་ལས་དཔྱད་དེ།
en: They analyze the kleśas, the karma, and the complex conduct of beings.

source: །དེ་དག་གདུལ་བའི་སྤྱོད་པས་ཡོན་ཏན་མང་པོ་གནོན།
en: Through the conduct that tames beings they ascend to many qualities,

source: །བདེ་གཤེགས་མཛོད་ཐོབ་དོན་གྱི་དམ་པ་རབ་ཏུ་སྟོན།
en: Attain the treasure of the sugatas, and teach the ultimate meaning.

source: །དཀར་ཆོས་རིམ་གྱིས་དེ་འདྲའི་སྤྱོད་དང་ལྡན་གྱུར་པས།
en: “They progressively gain good qualities through that conduct

source: །ས་དགུའི་བར་དུ་བསོད་ནམས་ཡེ་ཤེས་ཚོགས་ཐོབ་ཅིང་།
en: And until the ninth bhūmi obtain accumulations of merit and wisdom.

source: །རྒྱལ་བ་རྣམས་ཀྱི་སྟོབས་མཆོག་དོན་དམ་མངོན་འདོད་པ།
en: They desire the ultimate supreme power of the jinas

source: །ཡེ་ཤེས་ཡོན་ཏན་དབང་བསྐུར་སངས་རྒྱས་ཀུན་ལས་འཐོབ།
en: And receive from all the buddhas the consecration of wisdom and qualities.

source: །བརྒྱ་སྟོང་ཕྲག་བཅུའི་ཏིང་འཛིན་གྲངས་མེད་གང་ཡོད་པ།
en: “They have countless millions of samādhis;

source: །སྤྱོད་ཡུལ་ཤེས་པ་ཆེ་ཉིད་ཤེས་ཡངས་ཐོབ་གྱུར་ནས།
en: They know the range of activity and attain the vast knowledge of greatness.

source: །དེ་ཡི་རྗེས་ལ་ཐམས་ཅད་མཁྱེན་པར་དབང་བསྐུར་འཐོབ།
en: They subsequently receive the consecration of omniscience,

source: །ཡུལ་ཡངས་ཏིང་འཛིན་དེ་དག་ཐོས་པ་དེ་མི་སྒུལ།
en: And they do not deviate from the vast scope and the samādhis they have heard.

source: །གང་ཚེ་དེ་ཡིས་ཀུན་མཁྱེན་དབང་བསྐུར་ཐོབ་པའི་ཚེ།
en: “At the time when they receive the consecration of omniscience,

source: །པད་མོ་རྒྱ་ཆེན་རིན་ཆེན་ཀུན་གྱིས་བརྒྱན་པ་འབྱུང་།
en: There appear vast lotuses adorned with all jewels,

source: །དེ་ཡི་ཚུལ་མཐུན་ལུས་ཀྱི་དབུས་སུ་གནས་པར་འགྱུར།
en: And they reside in their centers in proportionately vast bodies

source: །རྒྱལ་བའི་སྲས་ཀྱིས་ཡོངས་བསྐོར་དེ་ལ་ལྟ་ཞིང་གནས།
en: Encircled by jinaputras who are gazing at them.

source: །དེ་ཡི་འོད་གཟེར་ཁྲག་ཁྲིག་མཐའ་ཡས་སྟོང་ཕྲག་མང་།
en: “Their infinite thousands of millions of light rays

source: །ཕྱོགས་བཅུའི་འགྲོ་བའི་སྡུག་བསྔལ་ཀུན་ཀྱང་ཞི་བར་བྱེད།
en: Bring to an end all the sufferings of beings in the ten directions.

source: །མགོ་ཡི་གཙུག་ནས་འོད་གཟེར་བྱེ་བ་སྟོང་བྱུང་ཞིང་།
en: From the crowns of their heads radiate thousands of millions of light rays

source: །ཕྱོགས་རྣམས་ཀུན་གྱི་མི་ཡི་གཙོ་བོའི་འཁོར་དུ་རྒྱུ།
en: That circle the supreme humans in all directions,

source: །སྟེང་གི་ནམ་མཁའི་དབྱིངས་ལ་འོད་གཟེར་དྲ་བ་གནས།
en: “Form networks of light rays in the space above,

source: །སངས་རྒྱས་མཆོད་ཕྱིར་བརྩོན་པར་རྒྱལ་བའི་ཞབས་སུ་འདོང་།
en: Make offerings to the buddhas, and then enter the feet of the jinas.

source: །དེའི་ཚེ་རྒྱལ་བ་རྣམས་དང་རྒྱལ་སྲས་རྣམས་ཀྱིས་ཀྱང་།
en: At that time, the jinas and the jinaputras

source: །ཆོས་རབ་དོན་དུ་རྒྱལ་སྲས་དབང་བསྐུར་ཐོབ་པར་མཁྱེན།
en: Know that the jinaputras have received consecration for the sake of supreme Dharma.

source: །མཆོད་པའི་དོན་དུ་རྒྱལ་སྲས་མཐའ་ཡས་ཀུན་ཀྱང་འོང་།
en: “All the infinite jinaputras come to make offerings to them,

source: །དེ་ཆོ་ཀུན་མཁྱེན་དབང་བསྐུར་མི་མཆོག་མཛོད་སྤུ་ནས།
en: And the consecration of omniscience comes from the ūrṇā hair of the supreme human.

source: །དབང་བསྐུར་འོད་གཟེར་དམ་པ་མང་པོ་འབྱུང་བར་འགྱུར།
en: A multitude of sacred light rays of consecration appear,

source: །འོད་གཟེར་མཆོག་གིས་བསྐོར་ཞིང་སྤྱི་བོའི་གཙུག་ཏུ་ནུབ།
en: And the supreme light rays circle and vanish into the crowns of their heads.

source: །གང་ཚེ་རྒྱལ་མཆོག་བུ་ཡི་ཐུ་བོ་སྲིད་མཆོག་ལ།
en: “At that time they gain the supreme existence, becoming the supreme Jina’s senior sons,

source: །དབང་བསྐུར་བཞིན་དུ་སངས་རྒྱས་ཀུན་གྱིས་དབང་བསྐུར་ཚེ།
en: And when they are consecrated, receiving the consecration of all the buddhas,

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་ཐམས་ཅད་ཀུན་ནས་གཡོ་བར་འགྱུར།
en: All the worlds in the ten directions shake,

source: །མནར་མེད་བར་གྱི་སྡུག་བསྔལ་དེ་ཚེ་ཞི་ཞིང་འདུག །གང་ཚེ་ཀུན་མཁྱེན་དབང་གིས་མངོན་པར་དབང་བསྐུར་བ།
en: And at that time all suffering down to the Avīci hell ceases. “At that time, they receive the consecration of omniscience.

source: །དེ་ཕྱིར་མཁས་པས་ཆོས་སྤྲིན་ས་མཆོག་ཐོབ་ཅེས་བྱ།
en: Therefore, the wise call this attaining the perfect bhūmi, Cloud of Dharma.

source: །མཁས་པ་འདི་ལ་གནས་པའི་ཤེས་རྒྱུད་ཚད་མེད་དེ།
en: The wise ones on this bhūmi have limitless knowledge.

source: །ས་རབ་འདི་ལ་གནས་པ་འགྲོ་ཀུན་གཙོ་ཡིན་ནོ།
en: When they are on this bhūmi, they are supreme among all beings. “They comprehend without error the entire vast realm of phenomena:

source: །གཟུགས་དང་གཟུགས་མེད་དེ་བཞིན་འདོད་པའི་ཁམས་ཡངས་དང་། །སེམས་ཅན་ཁམས་དང་ཞིང་དང་ཆོས་ཁམས་ཡངས་པ་དང་། །གྲངས་དང་གྲངས་མེད་ནམ་མཁའི་ཁམས་ཀྱི་བར་དུ་སྟེ།
en: The form and formless realms and likewise the desire realm, The elements of beings and realms and the vast elements of phenomena, Both numerable and innumerable, up to the element of space.

source: །ཆོས་དབྱིངས་ཡངས་པ་ཐམས་ཅད་མ་ནོར་ཁོང་དུ་ཆུད།
en: “Those on this bhūmi have great power, all the activities of emanation,

source: །འདི་ལ་གནས་པ་མཐུ་ཆེན་སྤྲུལ་པའི་ལས་ཀུན་དང་། །དེ་བཞིན་བྱིན་རླབས་རྒྱལ་བའི་ཡེ་ཤེས་ཕྲ་བ་དང་། །མི་མཆོག་གསང་བ་བསྐལ་བའི་གྲངས་རྣམས་ཤེས་བྱ་དང་། །སྐྲ་རྩེ་གཅིག་ཏུ་འཇིག་རྟེན་ཁམས་རྣམས་གཟུད་པ་དང་། །མི་ཡི་གཙོ་བོ་འབྱུང་དང་སྐུ་ཚེ་འཚང་རྒྱ་དང་། །འཁོར་ལོ་དམ་པ་བསྐོར་དང་མྱ་ངན་འདའ་བའི་རྣམས།
en: And, similarly, the blessing and the subtle wisdom of the jinas. They know the secrets of the supreme humans and the numbers of eons, And they make worlds enter into a single hair. “The appearances of the supreme humans, their lifespans and buddhahood, Their turning of the sublime wheel, and their passing into nirvāṇa—

source: །ཐམས་ཅད་རབ་ཤེས་གོང་དུ་རྣམ་ཐར་ཞི་བ་དག །སྔན་ཆད་མ་ཐོབ་ཀུན་ཀྱང་དེ་ཚེ་རབ་ཏུ་འཐོབ།
en: They know all these, and also the liberations and peace. At this time they will attain whatever has not been attained.

source: །འདི་ལ་གནས་པའི་མཐུ་ཆེན་རྒྱལ་བའི་ཆོས་ཀྱི་སྤྲིན།
en: “The powerful ones on this bhūmi apprehend the entirety

source: །ཐམས་ཅད་ཁོང་དུ་ཆུད་བྱེད་དྲན་པས་ཀུན་ཀྱང་འཛིན།
en: Of the Dharma clouds of the jinas and retain it all in their memory.

source: །ཀླུ་རྣམས་ཀུན་གྱི་སྤྲིན་ཆར་རྒྱ་མཚོ་འཛིན་པ་ལྟར།
en: Just as the ocean retains all the rain from the clouds of all nāgas,

source: །དེ་བཞིན་རྒྱལ་བའི་ཆོས་སྤྲིན་ཆར་ཆེན་ཀུན་ཀྱང་འཛིན།
en: In that way they retain the great rain from the Dharma clouds of the jinas.

source: །རྒྱལ་བ་གཅིག་ལས་ཆོས་གང་མཐུ་ཆེན་དེས་ཐོབ་པ།
en: “All the Dharma heard by the beings, and by all the śrāvakas of the sugatas

source: །དེ་ལ་ཕྱོགས་བཅུ་མཐའ་ཡས་ཞིང་གི་སེམས་ཅན་རྣམས། །ཐམས་ཅད་བདེ་གཤེགས་ཉན་ཐོས་ཐོས་པ་འཛིན་གྱུར་ཀྱང་།
en: In the infinite realms in the ten directions,

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐོས་པའི་གྲངས་ཆར་ཉེར་མི་འགྲོ།
en: Is not even a fraction of what these bodhisattvas hear When these powerful ones obtain the Dharma from just one jina.

source: །ཡེ་ཤེས་སྤྱོད་པའི་སྟོབས་ཀྱིས་སྔན་ཅད་སྤྱད་པའི་མཐུས།
en: “Through the power of wisdom conduct, through the power of previous conduct,

source: །སྐད་ཅིག་ཡུད་ཙམ་གཅིག་ཏུ་ཁྲག་ཁྲིག་ཞིང་བཀང་ཞིང་།
en: In just one instant, in one moment, they fill millions of realms

source: །བདུད་རྩིའི་ཆར་འབེབས་ཉོན་མོངས་ཀུན་ཀྱང་ཞི་བར་བྱེད།
en: With a rain of amrita that brings all the kleśas to an end.

source: །དེ་ཕྱིར་རྒྱལ་བས་འདི་མིང་ཆོས་ཀྱི་སྤྲིན་ཅེས་གསུངས།
en: Therefore, the buddhas have given this bhūmi the name Cloud of Dharma.

source: །འདི་ནས་མཐུ་ཆེན་ལྷ་ཡི་འཇིག་རྟེན་གཙོར་གྱུར་པའི།
en: “These powerful ones then become the lords in the deva realms

source: །ཕྱོགས་རྣམས་ཀུན་ཏུ་མི་ཡི་གཙོ་བོའི་ཡུལ་ཡང་སྟོན།
en: And in all directions manifest the scope of activity of the supreme humans.

source: །རྣམ་འཕྲུལ་ཁྲག་ཁྲིག་སྟོང་ཕྲག་དུ་མ་ཡང་སྟོན་ཏེ།
en: They manifest many thousands of millions of manifestations,

source: །བྱང་ཆུབ་སྤྱོད་པ་དེ་སེམས་འགྲོ་བ་མྱོས་པར་འགྱུར།
en: And their bodhisattva conduct intoxicates the minds of beings. “Those bodhisattvas up through the ninth bhūmi cannot comprehend

source: །མཁས་པ་ལེགས་ལྡན་འདི་གནས་གོམ་པ་བོར་བ་ཙམ། །ས་དགུའི་བར་དུ་གནས་པས་ཤེས་པར་མི་ནུས་ན།
en: Even the taking of a single step by the excellent wise ones on this bhūmi.

source: །སེམས་ཅན་གཞན་གྱིས་ཤེས་པར་མི་འགྱུར་སྨོས་ཅི་དགོས།
en: So, needless to say, it cannot be comprehended by beings,

source: །དུས་གསུམ་ཉན་ཐོས་རང་རྒྱལ་ཀུན་གྱིས་དེ་བཞིན་ནོ།
en: Or by the śrāvakas and pratyekabuddhas in the three times.

source: །འདི་གནས་ཐམས་ཅད་མཁྱེན་པར་འགྲོ་བ་ཀུན་ལ་སྟོན།
en: “Those on this bhūmi manifest omniscience to all beings.

source: །ཤེས་པས་དུས་གསུམ་ཀུན་ཏུ་ཐོགས་མེད་ཞི་ཆོས་ཅན།
en: They have the quality of peace through knowledge unimpeded by the three times.

source: །ཞིང་རྣམས་ཀུན་ཏུ་རྒྱས་བཀང་ཆོས་རྣམས་ཀུན་གྱི་བར།
en: They permeate and fill all realms as far as all phenomena,

source: །རྒྱལ་བ་ཀུན་གྱི་ཡོན་ཏན་བརྗོད་ཅིང་སྟོན་པ་བྱེད།
en: Describing and teaching the qualities of all jinas.

source: །མཁས་པ་འདི་ལ་གནས་པ་སངས་རྒྱས་མཆོད་བྱེད་ཅིང་།
en: “The wise ones on this bhūmi make offerings to the buddhas,

source: །ཕྱོགས་རྣམས་ཀུན་ཏུ་ཞིང་དང་ཆོས་ཀྱི་དབྱིངས་བཀང་སྟེ།
en: Filling all directions, worlds, and the realm of phenomena.

source: །རྒྱལ་བ་མངོན་དུ་མཆོད་པས་མཆོད་བྱེད་འཕྲོགས་པ་མེད།
en: Through their offerings to the jinas, they make insuperable offerings,

source: །ཡོན་ཏན་ཀུན་ལྡན་ས་ཡི་ལྷ་ཡི་ལྷ་ཞེས་བྱ།
en: And they are called the gods of the bhūmi gods, possessing all qualities.

source: །མཁས་པ་འདི་གནས་ཤེས་རབ་སྣང་བས་འགྲོ་ཀུན་གྱི།
en: “The wise ones on this bhūmi, through the light of their wisdom,

source: །མུན་པ་ཀུན་བསྩལ་ཆོས་ཀྱི་ཚུལ་ཡང་རབ་ཏུ་སྟོན།
en: Dispel the darkness in all beings and teach them the way of the Dharma.

source: །དབང་ཕྱུག་དམ་པའི་མཐུ་ཡིས་འགྲོ་བའི་འདོད་ཆགས་སེལ།
en: The sublime power of these lords dispels the desires of beings.

source: །དེ་བས་རྒྱལ་སྲས་ཉོན་མོངས་སེལ་ལ་མཁས་ཞེས་བྱ།
en: Therefore, these jinaputras are said to be skilled in eliminating the kleśas.

source: །འདི་ལ་གནས་པ་དེ་དག་ཁམས་གསུམ་དབང་ཕྱུག་འགྱུར།
en: “The ones on this bhūmi become supreme lords of the three realms.

source: །ཡེ་ཤེས་ཚུལ་ཤེས་ཐེག་པ་གསུམ་པོ་སྟོན་ལ་མཁས།
en: They know the way of wisdom and are skilled in teaching the three yānas.

source: །སྐད་ཅིག་ཡུད་ཙམ་ཅིག་གསི་ཏིང་འཛིན་གཅིག་མིན་ཐོབ།
en: In one instant, in one moment, they attain many samādhis,

source: །ཕྱོགས་བཅུ་ཀུན་ཏུ་རྒྱལ་བའི་དམ་པ་གཅིག་མིན་སྟོན།
en: And a multitude of jinas in all ten directions teach them.

source: །འདི་ནི་བདག་གིས་རྒྱལ་སྲས་ས་རྣམས་མདོར་བསྟན་གྱི།
en: “This was a brief teaching on the bhūmis of the jinaputras;

source: །རྒྱ་ཆེར་བསྐལ་པ་བརྒྱ་ཕྲག་སྟོང་གིས་བསྟན་མི་ནུས།
en: The extensive teaching would take more than a hundred thousand eons.

source: །ཡོན་ཏན་འདི་འདྲའི་སངས་རྒྱས་ཡེ་ཤེས་ས་འདི་ལ།
en: On this bhūmi, this quality of the wisdom of the buddhas

source: །གནས་པ་རྟག་ཏུ་རི་ཡི་རྒྱལ་པོ་བཞིན་མི་གཡོ།
en: Is always immovably present like the kings of mountains.

source: །རྒྱལ་སྲས་ཐོག་མ་གཙུག་ལག་ཀུན་གྱིས་མི་གཡོ་སྟེ།
en: “At first the jinaputra is immovable because of all his learning;

source: །སྨན་གྱི་རྣམ་པ་ཀུན་ནས་རི་རྒྱལ་གངས་བཞིན་ནོ།
en: He is the source of medicine, like Mount Himavat.

source: །ཚུལ་ཁྲིམས་ཐོས་པས་གཉིས་པ་སྤོས་ངད་སྤོས་དང་འདྲ།
en: Through listening and good conduct, the second bhūmi is like Mount Gandhamādana.

source: །རྣམ་འདལ་མེ་ཏོག་ཇི་བཞིན་གསུམ་པ་ཤེས་པར་བྱ།
en: The third bhūmi is known to be like the flowers of Vaipulya.

source: །ལམ་ལ་མོས་བཞིན་མི་འཁྲུགས་འོད་འཕྲོ་ཐོབ་པ་སྟེ།
en: “Aspiring to the path, they attain the unshakable Shining.

source: །དྲང་སྲོང་གནས་བཞིན་མཁས་པ་རྣམས་ཀྱི་རྟེན་གྱུར་པའོ།
en: Like Ṛṣigiri, they become a basis for the wise.

source: །གནོད་སྦྱིན་གཉའ་ཤིང་འཛིན་བཞིན་བསམ་ཡས་ལྔ་པ་ཐོབ།
en: They attain the inconceivable fifth bhūmi, which is like the yakṣas of Yugandhara.

source: །རྟ་རྣའི་ཤིང་ཏོག་འདྲ་བར་དྲུག་པའི་འབྲས་བུ་སྟེ།
en: The result that is the sixth bhūmi is like the trees and flowers of Aśvakarṇagiri.

source: །བདུན་པ་ས་འཛིན་ཀླུ་བཞིན་ཤེས་རབ་ཆེན་པོས་ཐོབ།
en: “The seventh bhūmi is like the nāgas of Nimindhara, and it is obtained through great wisdom.

source: །ཁོར་ཡུག་དབང་ལྡན་བཞིན་དུ་བརྒྱད་པ་དབང་ཅན་ཐོབ།
en: They attain the powerful eighth bhūmi, which is like the powerful Cakravāḍa.

source: །དགུ་པ་དྲི་མ་སེལ་བ་དཔལ་ཅན་ལྷ་མིན་བཞིན།
en: The ninth bhūmi eliminates stains and is like the asuras of Ketumat.

source: །བཅུ་པ་རྒྱལ་བའི་ལེགས་ལྡན་རི་རབ་ལྷ་གནས་འདྲ།
en: The tenth bhūmi has the excellence of the jinas and is like the devas of Sumeru.

source: །དང་པོ་སྨོན་ལམ་སྔོན་འགྲོ་གོང་མ་ཚུལ་ཁྲིམས་ཚོགས།
en: “The first bhūmi is preliminary aspiration, and the second is accumulating good conduct.

source: །གསུམ་པ་སྤྱོད་པའི་ཡོན་ཏན་བཞི་པ་གཅིག་གི་དངོས།
en: The third has the qualities of conduct, and the fourth is a singleness.

source: །ལྔ་པ་དགེ་མང་དྲུག་པ་ཤིན་ཏུ་ཟབ་པའི་དངོས།
en: The fifth has many virtues, and the sixth is extremely profound.

source: །བརྒྱད་པ་བློ་གྲོས་ཡངས་པ་ཀུན་ཏུ་གཅིག་མིན་རྒྱན།
en: The eighth has vast intelligence and a multitude of displays everywhere.

source: །དགུ་པ་མཁས་པ་ཡེ་ཤེས་ཕྲ་ཞིང་ཟབ་དང་ལྡན།
en: “On the ninth the wise have subtle and profound wisdom;

source: །འགྲོ་རྒྱུད་ཐམས་ཅད་ཡེ་ཤེས་ལྡན་པས་རབ་ཏུ་གནོན།
en: Through the wisdom of all the activities of beings they ascend.

source: །བཅུ་པ་རྒྱལ་བ་རྣམས་ལས་ཡང་དག་ཆོས་འཛིན་ཏེ།
en: The tenth retains the Dharma from all jinas,

source: །རྒྱལ་སྲས་སྤྱོད་པ་མི་སྒུལ་རྒྱ་མཚོ་དེ་འདྲའོ།
en: And the stainless conduct of the jinaputras is like a great ocean.

source: །སྤྱོད་པ་བཅུ་འདས་ཐོག་མའི་སེམས་རབ་སྐྱེ་བར་འགྱུར།
en: “Transcending the ten conducts, they first develop the motivation.

source: །དཀའ་ཐུབ་རྟུལ་བས་གཉིས་པ་གསུམ་པ་བསམ་གཏན་གྱིས།
en: The second is gained through discipline and hardship, the third through dhyāna,

source: །དག་པས་བཞི་པ་ཤིན་ཏུ་བྱང་བས་ལྔ་པའོ།
en: The fourth through purity, and the fifth through purification.

source: །དྲུག་པ་རྣོན་པོས་རྟོགས་པ་བདུན་པ་མི་ཕྱེད་ས།
en: The sixth is ascended to through realization, and the seventh is the Unwavering bhūmi.

source: །བརྒྱད་པ་མཐུ་ཆེན་རྡོ་རྗེའི་རྒྱལ་མཚན་ལྡན་པ་ཡིན།
en: “The eighth has great power and possesses the vajra victory banner.

source: །དགུ་ལ་ཡེ་ཤེས་ལྡན་པས་ཐིབས་པོའི་སྤྱོད་པ་ཤེས།
en: On the ninth there is the wisdom that knows the complexity of conducts.

source: །བཅུ་ལ་རྒྱལ་བས་དབང་བསྐུར་རྒྱལ་པོ་དབང་ཐོབ་བཞིན།
en: On the tenth there is the consecration from the jinas, like being consecrated as a king.

source: །ཡོན་ཏན་རིན་ཆེན་དག་པས་དེ་བཞིན་རིམ་དུ་འཕར།
en: In that way there is a progressive ascension through pure precious qualities.

source: །ཕྱོགས་རྣམས་ཀུན་གྱི་ཞིང་རྣམས་བཤིག་སྟེ་བགྲང་བར་ནུས།
en: “They can divide and count the worlds in the ten directions.

source: །རྣམ་ཤེས་གཅིག་གིས་འགྲོ་བ་ཀུན་སེམས་ཤེས་པར་རུང་།
en: With one consciousness they can know the minds of all beings.

source: །ནམ་མཁའི་དབྱིངས་ཀུན་སྐྲ་ཡིས་གཞལ་བར་ནུས་སྲིད་ཀྱི།
en: It is possible to measure the entire realm of space with a single hair,

source: །རྒྱལ་བའི་ཡོན་ཏན་བསྐལ་པ་ཁྲག་ཁྲིག་བཤད་མི་ནུས།
en: But one cannot describe the qualities of the jinas, even in ten million eons.”
